Исследование данных сервиса “Яндекс.Музыка” — сравнение пользователей двух городов

# Задача
На реальных данных Яндекс.Музыки c помощью библиотеки Pandas и её возможностей проверить данные и сравнить поведение и предпочтения пользователей двух столиц — Москвы и Санкт-Петербурга.

# Описание проекта
Сравнение Москвы и Петербурга окружено мифами:
- Москва — мегаполис, подчинённый жёсткому ритму рабочей недели;
- Петербург — город своеобразной культуры, непохожий на Москву.
Некоторые мифы отражают действительность. Другие — пустые стереотипы. Бизнес должен отличать первые от вторых, чтобы принимать рациональные решения. На реальных данных Яндекс.Музыки вы проверите данные и сравните поведение пользователей двух столиц.

# Выводы
Выводы из анализа данных:

1. Гипотеза о влиянии дня недели на активность пользователей в Москве и Петербурге была подтверждена. Действительно, день недели оказывает различное влияние на активность пользователей в этих городах.

2.  Вторая гипотеза о стабильности музыкальных предпочтений в течение недели не получила полного подтверждения. Хотя основные жанры остаются примерно одинаковыми, наблюдаются некоторые различия, особенно в начале недели.

3. Что касается третьей гипотезы, то она не подтверждена. Пользователи Москвы и Петербурга имеют больше общих музыкальных предпочтений, чем различий. Этот факт может быть неожиданным, учитывая различия в других аспектах между этими городами.

 Необходимо отметить, что в исследовании были использованы статистические методы проверки гипотез. Однако, следует помнить, что данные получены только от одного сервиса и не обязательно представляют всю популяцию. Для более точных и достоверных результатов требуется проведение дополнительных исследований и использование более широких выборок данных.
 
# Стек технологий
Pandas, Python, data analyst, аналитик данных, аналитик, analyst, обработка данных, дубликаты, пропуски, логическая индексация, группировка, сортировка

# Направление
Data Analyst

# Статус проекта
Завершен
